In [28]:
import pandas as pd

std_data = pd.read_csv("students_info.csv")
#print(std_data)

In [11]:
#std_data.head()
#std_data.tail()
#std_data.head(3)
std_data.shape

(30, 8)

In [12]:
std_data.columns

Index(['student_id', 'name', 'gender', 'age', 'course', 'city', 'marks',
       'attendance'],
      dtype='object')

In [15]:
#std_data.info()
std_data.describe()

       student_id        age     marks  attendance
count   30.000000  30.000000  30.00000   30.000000
mean    15.500000  21.733333  78.70000   85.100000
std      8.803408   1.362891   9.86862    9.173989
min      1.000000  20.000000  58.00000   60.000000
25%      8.250000  21.000000  72.25000   80.250000
50%     15.500000  22.000000  79.50000   87.500000
75%     22.750000  23.000000  87.50000   91.750000
max     30.000000  24.000000  93.00000   97.000000

In [20]:
#std_data['name']
#std_data['city']
std_data[["name" , "city" , 'age']]

               name        city  age
0      Aarav Sharma      Mumbai   20
1      Ananya Verma       Delhi   21
2       Rohan Patel   Ahmedabad   22
3        Priya Iyer     Chennai   20
4      Vikram Singh      Jaipur   23
5        Neha Gupta      Kanpur   21
6       Arjun Mehta        Pune   22
7       Kavya Reddy   Hyderabad   20
8      Suresh Kumar  Coimbatore   24
9        Pooja Nair       Kochi   22
10        Rahul Das     Kolkata   21
11   Shivani Mishra      Bhopal   23
12       Amit Joshi      Indore   20
13   Sneha Kulkarni      Nagpur   22
14   Karan Malhotra       Delhi   21
15     Meena Pillai  Trivandrum   24
16    Nikhil Chawla       Noida   22
17       Divya Shah       Surat   20
18       Sanjay Rao      Mysore   23
19     Anjali Sinha       Patna   21
20     Manish Yadav     Gurgaon   22
21      Ritu Saxena        Agra   23
22      Deepak Rana    Dehradun   24
23       Payal Jain     Udaipur   20
24  Abhishek Tiwari        Rewa   21
25   Swati Banerjee      Howrah   22
26     Mohit Bansal       Hisar   23
27      Komal Patil      Nashik   21
28     Rajeev Menon    Thrissur   24
29      Isha Kapoor  Chandigarh   20

In [24]:
#std_data.loc[29]
std_data.iloc[0]

student_id               1
name          Aarav Sharma
gender                   M
age                     20
course                 BCA
city                Mumbai
marks                   78
attendance              85
Name: 0, dtype: object

In [29]:
std_data.isnull().sum()

student_id    0
name          1
gender        2
age           0
course        0
city          0
marks         0
attendance    0
dtype: int64

In [31]:
std_data.duplicated().sum()

np.int64(0)

In [41]:
#std_data[std_data["marks"] > 70]
#std_data[std_data["age"] > 21]
#std_data[std_data["gender"] == "F"]
#std_data.sort_values("marks", ascending=True)
std_data["marks"].max()
std_data["marks"].min()

std_data["student_id"].value_counts()

student_id
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
13    1
14    1
15    1
16    1
17    1
18    1
19    1
20    1
21    1
22    1
23    1
24    1
25    1
26    1
27    1
28    1
29    1
30    1
Name: count, dtype: int64